In [9]:
import os
import pandas as pd
import numpy as np

In [10]:
# Config
folder = '/Users/rumszz/Documents/LearningBackup/application_sample/problem/data'

In [6]:
os.listdir(folder)

['coupon_item_mapping.csv',
 'customer_demographics.csv',
 'campaign_data.csv',
 'train_data.csv',
 'customer_transaction_data.csv',
 'test_data.csv',
 'item_data.csv']

In [78]:
camp_data_file = 'campaign_data.csv'
camp_data_df = pd.read_csv(os.path.join(folder, camp_data_file) , sep=',')
camp_data_df['start_date2'] = pd.to_datetime(camp_data_df['start_date'], format='%d/%m/%y')
camp_data_df['end_date2'] = pd.to_datetime(camp_data_df['end_date'], format='%d/%m/%y')
camp_data_df['start_quarter'] = pd.PeriodIndex(camp_data_df.start_date2, freq='Q')
camp_data_df['start_Month'] = pd.PeriodIndex(camp_data_df.start_date2, freq='M')
camp_data_df['start_Year'] = pd.PeriodIndex(camp_data_df.start_date2, freq='Y')
camp_data_df['end_quarter'] = pd.PeriodIndex(camp_data_df.end_date2, freq='Q')
camp_data_df['end_Month'] = pd.PeriodIndex(camp_data_df.end_date2, freq='M')
camp_data_df['end_Year'] = pd.PeriodIndex(camp_data_df.end_date2, freq='Y')

In [86]:
camp_data_df

,campaign_id,campaign_type,start_date,end_date,start_date2,end_date2,start_quarter,start_Month,start_Year,end_quarter,end_Month,end_Year
0,24,Y,21/10/13,20/12/13,2013-10-21,2013-12-20,2013Q4,2013-10,2013,2013Q4,2013-12,2013
1,25,Y,21/10/13,22/11/13,2013-10-21,2013-11-22,2013Q4,2013-10,2013,2013Q4,2013-11,2013
2,20,Y,07/09/13,16/11/13,2013-09-07,2013-11-16,2013Q3,2013-09,2013,2013Q4,2013-11,2013
3,23,Y,08/10/13,15/11/13,2013-10-08,2013-11-15,2013Q4,2013-10,2013,2013Q4,2013-11,2013
4,21,Y,16/09/13,18/10/13,2013-09-16,2013-10-18,2013Q3,2013-09,2013,2013Q4,2013-10,2013
5,22,X,16/09/13,18/10/13,2013-09-16,2013-10-18,2013Q3,2013-09,2013,2013Q4,2013-10,2013
6,18,X,10/08/13,04/10/13,2013-08-10,2013-10-04,2013Q3,2013-08,2013,2013Q4,2013-10,2013
7,19,Y,26/08/13,27/09/13,2013-08-26,2013-09-27,2013Q3,2013-08,2013,2013Q3,2013-09,2013
8,17,Y,29/07/13,30/08/13,2013-07-29,2013-08-30,2013Q3,2013-07,2013,2013Q3,2013-08,2013
9,16,Y,15/07/13,16/08/13,2013-07-15,2013-08-16,2013Q3,2013-07,2013,2013Q3,2013-08,2013
10,13,X,19/05/13,05/07/13,2013-05-19,2013-07-05,2013Q2,2013-05,2013,2013Q3,2013-07,2013
11,11,Y,22/04/13,07/06/13,2013-04-22,2013-06-07,2013Q2,2013-04,2013,2013Q2,2013-06,2013
12,12,Y,22/04/13,24/05/13,2013-04-22,2013-05-24,2013Q2,2013-04,2013,2013Q2,2013-05,2013
13,10,Y,08/04/13,10/05/13,2013-04-08,2013-05-10,2013Q2,2013-04,2013,2013Q2,2013-05,2013
14,9,Y,11/03/13,12/04/13,2013-03-11,2013-04-12,2013Q1,2013-03,2013,2013Q2,2013-04,2013
15,8,X,16/02/13,05/04/13,2013-02-16,2013-04-05,2013Q1,2013-02,2013,2013Q2,2013-04,2013
16,7,Y,02/02/13,08/03/13,2013-02-02,2013-03-08,2013Q1,2013-02,2013,2013Q1,2013-03,2013
17,6,Y,28/01/13,01/03/13,2013-01-28,2013-03-01,2013Q1,2013-01,2013,2013Q1,2013-03,2013
18,3,Y,22/12/12,16/02/13,2012-12-22,2013-02-16,2012Q4,2012-12,2012,2013Q1,2013-02,2013
19,5,Y,12/01/13,15/02/13,2013-01-12,2013-02-15,2013Q1,2013-01,2013,2013Q1,2013-02,2013
20,4,Y,07/01/13,08/02/13,2013-01-07,2013-02-08,2013Q1,2013-01,2013,2013Q1,2013-02,2013
21,1,Y,12/12/12,18/01/13,2012-12-12,2013-01-18,2012Q4,2012-12,2012,2013Q1,2013-01,2013
22,2,Y,17/12/12,18/01/13,2012-12-17,2013-01-18,2012Q4,2012-12,2012,2013Q1,2013-01,2013
23,30,X,19/11/12,04/01/13,2012-11-19,2013-01-04,2012Q4,2012-11,2012,2013Q1,2013-01,2013
24,29,Y,08/10/12,30/11/12,2012-10-08,2012-11-30,2012Q4,2012-10,2012,2012Q4,2012-11,2012
25,28,Y,16/09/12,16/11/12,2012-09-16,2012-11-16,2012Q3,2012-09,2012,2012Q4,2012-11,2012
26,27,Y,25/08/12,27/10/12,2012-08-25,2012-10-27,2012Q3,2012-08,2012,2012Q4,2012-10,2012
27,26,X,12/08/12,21/09/12,2012-08-12,2012-09-21,2012Q3,2012-08,2012,2012Q3,2012-09,2012

In [85]:
camp_data_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 28 entries, 0 to 27
Data columns (total 12 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   campaign_id    28 non-null     int64
 1   campaign_type  28 non-null     object
 2   start_date     28 non-null     object
 3   end_date       28 non-null     object
 4   start_date2    28 non-null     datetime64[ns]
 5   end_date2      28 non-null     datetime64[ns]
 6   start_quarter  28 non-null     period[Q-DEC]
 7   start_Month    28 non-null     period[M]
 8   start_Year     28 non-null     period[A-DEC]
 9   end_quarter    28 non-null     period[Q-DEC]
 10  end_Month      28 non-null     period[M]
 11  end_Year       28 non-null     period[A-DEC]
dtypes: datetime64[ns](2), int64(1), object(3), period[A-DEC](2), period[M](2), period[Q-DEC](2)
memory usage: 2.8+ KB

In [ ]:
## find campaigns that are running in the last 6 months
## last transaction was on 2013-07-03 so find campaigns between 2013-04-03 and 2013-07-03

In [84]:
in_between = camp_data_df.purchaseDate.between(df.releaseDate, df.ceaseDate)
camp_data_df['status'] = np.where(in_between, 'Active', 'Inactive')
camp_data_df.head()

In [12]:
train_file = 'train_data.csv'
train_df = pd.read_csv(os.path.join(folder, train_file) , sep=',')

In [15]:
train_df.head()

       id  campaign_id  coupon_id  customer_id  redemption_status
0  117578            8        725           45                  0
1  123337           29        265          334                  0
2   46642           13        281          408                  0
3   10510           13        625          577                  0
4   14347           13        480          414                  0

In [14]:
train_df.groupby(['customer_id']).count().count()

id                   1428
campaign_id          1428
coupon_id            1428
redemption_status    1428
dtype: int64

In [19]:
train_df.groupby(['redemption_status']).customer_id.nunique()

redemption_status
0    1428
1     213
Name: customer_id, dtype: int64

In [27]:
cust_redeemed  = train_df[(train_df.redemption_status == 1)][['customer_id']]
print(cust_redeemed.count())

customer_id    518
dtype: int64

In [28]:
518/1428

0.3627450980392157

In [88]:
df = train_df.groupby(['customer_id','campaign_id']).nunique().reset_index()
df = df[['customer_id','campaign_id']]
df2 = df.groupby(['customer_id'])['campaign_id'].nunique().reset_index(name='numcampaigns')
df3 = df2.groupby(['numcampaigns'])['customer_id'].nunique().reset_index(name='count')
df3

    numcampaigns  count
0              1    312
1              2    346
2              3    288
3              4    217
4              5    153
5              6     71
6              7     27
7              8     10
8              9      2
9             10      1
10            11      1

In [89]:
df3[df3['numcampaigns'] >= 6]['count'].sum() # there are 112 customers who were a part of 6 or more campaigns.

112

In [30]:
customer_demographics_file = 'customer_demographics.csv'
customer_demographics_df = pd.read_csv(os.path.join(folder, customer_demographics_file) , sep=',')
customer_demographics_df.head()

,customer_id,age_range,marital_status,rented,family_size,no_of_children,income_bracket
0,1,70+,Married,0,2,NaN,4
1,6,46-55,Married,0,2,NaN,5
2,7,26-35,NaN,0,3,1,3
3,8,26-35,NaN,0,4,2,6
4,10,46-55,Single,0,1,NaN,5

In [32]:
customer_transaction_file = 'customer_transaction_data.csv'
customer_transaction_df = pd.read_csv(os.path.join(folder, customer_transaction_file) , sep=',')
customer_transaction_df.head()

,date,customer_id,item_id,quantity,selling_price,other_discount,coupon_discount
0,2012-01-02,1501,26830,1,35.26,-10.69,0.0
1,2012-01-02,1501,54253,1,53.43,-13.89,0.0
2,2012-01-02,1501,31962,1,106.50,-14.25,0.0
3,2012-01-02,1501,33647,1,67.32,0.00,0.0
4,2012-01-02,1501,48199,1,71.24,-28.14,0.0

In [35]:
customer_transaction_df.groupby(['date'])['customer_id'].nunique()

date
2012-01-02      8
2012-01-03      5
2012-01-04     25
2012-01-05     26
2012-01-06     14
             ...
2013-06-29    299
2013-06-30    284
2013-07-01    262
2013-07-02    255
2013-07-03    272
Name: customer_id, Length: 549, dtype: int64

In [33]:
customer_transaction_df.groupby(['customer_id', 'date']).count()

                        item_id  quantity  selling_price  other_discount  \
customer_id date
1           2012-02-21       27        27             27              27
            2012-03-08       10        10             10              10
            2012-03-29        8         8              8               8
            2012-04-04       19        19             19              19
            2012-04-11       14        14             14              14
...                         ...       ...            ...             ...
1582        2013-06-09       19        19             19              19
            2013-06-10        1         1              1               1
            2013-06-17       15        15             15              15
            2013-06-20        8         8              8               8
            2013-06-25       18        18             18              18

                        coupon_discount
customer_id date
1           2012-02-21               27
            2012-03-08               10
            2012-03-29                8
            2012-04-04               19
            2012-04-11               14
...                                 ...
1582        2013-06-09               19
            2013-06-10                1
            2013-06-17               15
            2013-06-20                8
            2013-06-25               18

[142445 rows x 5 columns]

In [37]:
import datetime

In [38]:
customer_transaction_df.date2 = pd.to_datetime(customer_transaction_df.date)

In [39]:
customer_transaction_df['quarter'] = pd.PeriodIndex(customer_transaction_df.date2, freq='Q')
customer_transaction_df['Month'] = pd.PeriodIndex(customer_transaction_df.date2, freq='M')
customer_transaction_df['Year'] = pd.PeriodIndex(customer_transaction_df.date2, freq='Y')

In [42]:
customer_transaction_df.head()

,date,customer_id,item_id,quantity,selling_price,other_discount,coupon_discount,quarter,Month,Year
0,2012-01-02,1501,26830,1,35.26,-10.69,0.0,2012Q1,2012-01,2012
1,2012-01-02,1501,54253,1,53.43,-13.89,0.0,2012Q1,2012-01,2012
2,2012-01-02,1501,31962,1,106.50,-14.25,0.0,2012Q1,2012-01,2012
3,2012-01-02,1501,33647,1,67.32,0.00,0.0,2012Q1,2012-01,2012
4,2012-01-02,1501,48199,1,71.24,-28.14,0.0,2012Q1,2012-01,2012

In [54]:
customer_transaction_df.groupby(['Month']).nunique().count()[0]

19

In [75]:

df = customer_transaction_df.groupby(['Month','customer_id']).nunique().reset_index()
df = df[['Month','customer_id']]

df2 = df.groupby(['customer_id'])['Month'].nunique().reset_index(name='Months')
df3 = df2.groupby(['Months'])['customer_id'].nunique().reset_index(name='count')
df3

    Months  count
0        4      2
1        5      3
2        6      5
3        7      7
4        8      5
5        9     11
6       10     14
7       11     30
8       12     56
9       13     85
10      14    108
11      15    284
12      16    380
13      17    295
14      18    199
15      19     98

In [44]:
item_data_file = 'campaign_data.csv'
item_data_df = pd.read_csv(os.path.join(folder, camp_data_file) , sep=',')

In [76]:
item_data_df.groupby(['category']).nunique().reset_index()

                  category  item_id  brand  brand_type
0                  Alcohol      303     45           1
1                   Bakery     1679    127           2
2   Dairy, Juices & Snacks     2425    223           2
3         Flowers & Plants      664    144           2
4                     Fuel       14      1           1
5                   Garden      102     14           2
6                  Grocery    32448   1395           2
7                     Meat     2080    877           2
8            Miscellaneous      385    218           2
9         Natural Products     2533    214           2
10           Packaged Meat     1966    143           2
11          Pharmaceutical    24471   1653           2
12           Prepared Food     1880    703           2
13             Restauarant       78      8           1
14                  Salads       40     14           2
15                 Seafood      728    225           2
16        Skin & Hair Care     2244    145           2
17                  Travel       19      4           1
18        Vegetables (cut)        7      6           1

In [46]:

df = item_data_df.groupby(['category','customer_id']).nunique().reset_index()
df = df[['Month','customer_id']]

df2 = df.groupby(['customer_id'])['Month'].nunique().reset_index(name='Months')
df3 = df2.groupby(['Months'])['customer_id'].nunique().reset_index(name='count')
df3

   item_id  brand   brand_type       category
0        1      1  Established        Grocery
1        2      1  Established  Miscellaneous
2        3     56        Local         Bakery
3        4     56        Local        Grocery
4        5     56        Local        Grocery